apache-jmeter/Test Plan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">120</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <com.di.jmeter.kafka.config.KafkaProducerConfig guiclass="TestBeanGUI" testclass="com.di.jmeter.kafka.config.KafkaProducerConfig" testname="Kafka Producer Config" enabled="true">
          <stringProp name="batchSize">16384</stringProp>
          <stringProp name="clientId">JMeter-Producer-1</stringProp>
          <collectionProp name="extraConfigs"/>
          <stringProp name="kafkaBrokers">localhost:19092</stringProp>
          <stringProp name="kafkaProducerClientVariableName">KafkaProducerClient</stringProp>
          <stringProp name="kafkaSslKeystorePassword">Chang3M3</stringProp>
          <stringProp name="kafkaSslPrivateKeyPass">Chang3M3</stringProp>
          <stringProp name="kafkaSslTruststorePassword">Chang3M3</stringProp>
          <stringProp name="securityType">securityType.plaintext</stringProp>
          <stringProp name="serializerKey">org.apache.kafka.common.serialization.StringSerializer</stringProp>
          <stringProp name="serializerValue">org.apache.kafka.common.serialization.StringSerializer</stringProp>
        </com.di.jmeter.kafka.config.KafkaProducerConfig>
        <hashTree/>
        <com.di.jmeter.kafka.sampler.KafkaProducerSampler guiclass="TestBeanGUI" testclass="com.di.jmeter.kafka.sampler.KafkaProducerSampler" testname="Kafka Producer Sampler" enabled="true">
          <stringProp name="kafkaMessage">{&quot;host&quot;: &quot;${HOST}&quot;,&quot;user-agent&quot;: &quot;python/requests&quot;,&quot;datetime&quot;: &quot;${__time(dd/MMM/yyyy:HH:mm:ss XXXX,)}&quot;,&quot;method&quot;: &quot;get&quot;,&quot;protocol&quot;: &quot;HTTP/1.1&quot;,&quot;status&quot;: ${STATUS},&quot;bytes&quot;: 6363,&quot;url&quot;: &quot;https://authenticator${QUERY}&quot;}</stringProp>
          <stringProp name="kafkaProducerClientVariableName">KafkaProducerClient</stringProp>
          <stringProp name="kafkaTopic">nginx</stringProp>
          <collectionProp name="messageHeaders"/>
        </com.di.jmeter.kafka.sampler.KafkaProducerSampler>
        <hashTree/>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config" enabled="true">
          <stringProp name="filename">/Users/mjh/src/HMRC/next-gen-ingest/variables.csv</stringProp>
          <stringProp name="fileEncoding">UTF-8</stringProp>
          <stringProp name="variableNames">HOST,STATUS,QUERY </stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <stringProp name="delimiter">,</stringProp>
          <boolProp name="quotedData">true</boolProp>
          <boolProp name="recycle">true</boolProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
        </CSVDataSet>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>